In [28]:
import pandas as pd
df = pd.DataFrame({'name':['홀란','김덕배','음바페'],
                  'goal': [40,12,30],
                  'age' : [22, 32, 25]})
df

  name  goal  age
0   홀란    40   22
1  김덕배    12   32
2  음바페    30   25

In [29]:
df['name']

0     홀란
1    김덕배
2    음바페
Name: name, dtype: object

In [30]:
sum(df['age'])/3

26.333333333333332

In [34]:
dict1 = ({'제품':['사과','딸기','수박'],
                   '가격':[1800,1500,3000],
                   '판매량':[24, 38, 13]})
df2 = pd.DataFrame(dict1)
df2

   제품    가격  판매량
0  사과  1800   24
1  딸기  1500   38
2  수박  3000   13

In [35]:
sum(df2['가격'])/3

2100.0

In [40]:
df2['판매량'].sum()/3

25.0

In [37]:
df2.index

RangeIndex(start=0, stop=3, step=1)

In [38]:
df2.columns

Index(['제품', '가격', '판매량'], dtype='object')

In [39]:
df2.values

array([['사과', 1800, 24],
       ['딸기', 1500, 38],
       ['수박', 3000, 13]], dtype=object)

In [41]:
len(df)

3

In [47]:
# 평균
df['age'].mean()

26.333333333333332

In [48]:
type(df)

pandas.core.frame.DataFrame

In [49]:
#컬럼 추출
# Series 와 DataFrame 의 차이
s0 = df['name']
s1 = df[['name']]
s1

  name
0   홀란
1  김덕배
2  음바페

In [50]:
type(s0)

pandas.core.series.Series

In [51]:
type(s1)

pandas.core.frame.DataFrame

In [52]:
df[['goal']]>30

    goal
0   True
1  False
2  False

In [53]:
pd.em = df[['age', 'goal']] > 26
pd.em.sum()

age     1
goal    2
dtype: int64

In [54]:
df.sum()

name    홀란김덕배음바페
goal          82
age           79
dtype: object

In [55]:
# index를 사람이름으로
df3 = pd.DataFrame(
    data = [[90, 50],[80, 60], [60, 100], [70, 20]],
    columns = ['english', 'math'],
    index = ['김기훈', '이유진', '박동현', '김민지'])
df3

     english  math
김기훈       90    50
이유진       80    60
박동현       60   100
김민지       70    20

In [56]:
df3.index

Index(['김기훈', '이유진', '박동현', '김민지'], dtype='object')

In [57]:
df3.columns

Index(['english', 'math'], dtype='object')

In [58]:
df3.values

array([[ 90,  50],
       [ 80,  60],
       [ 60, 100],
       [ 70,  20]], dtype=int64)

In [59]:
df3['math'].mean()

57.5

In [64]:
df3 > 50

     english   math
김기훈     True  False
이유진     True   True
박동현     True   True
김민지     True  False

In [67]:
df4 = pd.DataFrame(
    [[1800, 24],[1500, 38], [3000, 13]],
    index = ['사과', '딸기', '수박'],
    columns = ['가격', '판매량'])
df4

      가격  판매량
사과  1800   24
딸기  1500   38
수박  3000   13

In [81]:
df_exam = pd.read_excel('excel_exam.xlsx').set_index('id')

In [82]:
df_exam

    nclass  math  english  science
id
1        1    50       98       50
2        1    60       97       60
3        1    45       86       78
4        1    30       98       58
5        2    25       80       65
6        2    50       89       98
7        2    80       90       45
8        2    90       78       25
9        3    20       98       15
10       3    50       98       45
11       3    65       65       65
12       3    45       85       32
13       4    46       98       65
14       4    48       87       12
15       4    75       56       78
16       4    58       98       65
17       5    65       68       98
18       5    80       78       90
19       5    89       68       87
20       5    78       83       58

In [71]:
df_exam['math'].sum()

1149

In [72]:
df_exam['math'].mean()

57.45

In [80]:
len(df_exam)

20

In [84]:
df_exam.mean()

nclass      3.00
math       57.45
english    84.90
science    59.45
dtype: float64

In [107]:
pd_excel_exam_novar = pd.read_excel('excel_exam_novar.xlsx', header = None)
pd_excel_exam_novar.head()

   0  1   2   3   4
0  1  1  50  98  50
1  2  1  60  97  60
2  3  2  25  80  65
3  4  2  50  89  98
4  5  3  20  98  15

In [108]:
pd_excel_exam_novar.columns = ['id', 'nclass', 'math', 'english', 'science']

In [113]:
pd_excel_exam_novar

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       2    25       80       65
3   4       2    50       89       98
4   5       3    20       98       15
5   6       3    50       98       45
6   7       4    46       98       65
7   8       4    48       87       12

In [114]:
pd_excel_exam_novar.to_csv('excel_exam_csv.csv')

In [110]:
e1 = pd_excel_exam_novar.set_index('id')
e1

    nclass  math  english  science
id
1        1    50       98       50
2        1    60       97       60
3        2    25       80       65
4        2    50       89       98
5        3    20       98       15
6        3    50       98       45
7        4    46       98       65
8        4    48       87       12

In [105]:
df_exam_csv = pd.read_csv('exam.csv')
df_exam_csv

    id  nclass  math  english  science
0    1       1    50       98       50
1    2       1    60       97       60
2    3       1    45       86       78
3    4       1    30       98       58
4    5       2    25       80       65
5    6       2    50       89       98
6    7       2    80       90       45
7    8       2    90       78       25
8    9       3    20       98       15
9   10       3    50       98       45
10  11       3    65       65       65
11  12       3    45       85       32
12  13       4    46       98       65
13  14       4    48       87       12
14  15       4    75       56       78
15  16       4    58       98       65
16  17       5    65       68       98
17  18       5    80       78       90
18  19       5    89       68       87
19  20       5    78       83       58

In [130]:
(df_exam_csv[['math','english','science']] >= 50).sum()

math       13
english    20
science    14
dtype: int64

In [121]:
df_exam_csv['math'].mean()

57.45